Repository: mateirobescu/mateirobescu.com
Catalog: backend/portfolio/locale/*/LC_MESSAGES/django.po
Languages: ro

source: Personal portfolio of Matei Robescu — showcasing web development projects, Django apps, and AWS cloud experiments.
ro: Portofoliul personal al lui Matei Robescu — prezentând proiecte de dezvoltare web, aplicații Django și experimente în cloud AWS.

source: Matei Robescu, mateirobescu, portfolio, Django, AWS, Python, web development, projects
ro: Matei Robescu, mateirobescu, portofoliu, Django, AWS, Python, dezvoltare web, proiecte

source: home
ro: acasă

source: projects
ro: proiecte

source: Logo of mateirobescu.com
ro: Logo-ul mateirobescu.com

source: This site is protected by reCAPTCHA and the Google
ro: Acest site este protejat de reCAPTCHA și de

source: Privacy Policy
ro: Politica de Confidențialitate

source: and
ro: și

source: Terms of Service
ro: Termenii și Condițiile

source: apply.
ro: Google se aplică.

source: %(current_year)s Matei Robescu. Built with Django.
ro: %(current_year)s Matei Robescu. Realizat cu Django.

source: Matei Robescu | Personal Portfolio
ro: Matei Robescu | Portofoliu personal

source: About me
ro: Despre mine

source: ABOUT<br>ME
ro: DESPRE<br>MINE

source: Hi!
ro: Salut!

source: My name is <strong>Matei Robescu</strong>, I'm 20 years old and currently a 2nd year student at <strong>Faculty of Cybernetics, Statistics and Economic Informatics, ASE</strong>, specializing in <em>Informatica Economică</em>.
ro: Mă numesc <strong>Matei Robescu</strong>, am 20 de ani și sunt student în anul 2 la <strong>Facultatea de Cibernetică, Statistică și Informatică Economică, ASE</strong>, specializarea <em>Informatică Economică</em>.

source: I've been passionate about technology since I was really young and this portfolio is my way of sharing that journey — through the projects I am working on and the skills I continue to develop.
ro: Sunt pasionat de tehnologie încă de mic, iar acest portofoliu este modul meu de a împărtăși această călătorie — prin proiectele la care lucrez și abilitățile pe care continui să le dezvolt.

source: Technologies I've worked with — and I'm always open to learning more.
ro: Tehnologii cu care am lucrat — și sunt mereu deschis să învăț altele noi.

source: Projects
ro: Proiecte

source: All
ro: Toate

source: Live demo
ro: Demo live

source: I haven't built anything like this... yet!
ro: Nu am construit încă ceva de acest fel... încă!

source: Education
ro: Educație

source: Bachelor degree in Computer Science
ro: Licență în Informatică

source: Faculty of Cybernetics, Statistics and Economic Informatics
ro: Facultatea de Cibernetică, Statistică și Informatică Economică

source: Bucharest, RO
ro: București, RO

source: Nov. 2025 &ndash; Present
ro: Nov. 2025 &ndash; Prezent

source: Built a serverless AWS ETL pipeline using Lambda, S3, DynamoDB, RDS, and Secrets Manager, with all infrastructure managed through Terraform.
ro: Am construit un pipeline ETL serverless pe AWS folosind Lambda, S3, DynamoDB, RDS și Secrets Manager, cu toată infrastructura gestionată prin Terraform.

source: Automated ingestion, cleaning, and transformation of weather-API data using Python, storing validated results in MySQL for further analysis.
ro: Preluare automată, curățare și transformare a datelor din weather-API folosind Python, cu stocarea rezultatelor validate în MySQL pentru analize ulterioare.

source: mateirobescu.com Personal Portfolio
ro: Portofoliul personal mateirobescu.com

source: Developed a full-stack portfolio web app with Python, Django, JavaScript, HTML/SCSS to showcase personal projects.
ro: Am dezvoltat o aplicație web full-stack de portofoliu cu Python, Django, JavaScript, HTML/SCSS pentru a prezenta proiecte personale.

source: Deployed to AWS EC2 with Gunicorn + Nginx for production readiness.
ro: Implementat pe AWS EC2 cu Gunicorn + Nginx pentru rulare în producție.

source: Integrated PostgreSQL and Cloudinary for scalable data &amp; media management.
ro: Am integrat PostgreSQL și Cloudinary pentru gestionarea scalabilă a datelor și media.

source: Developed a fast, minimalist countdown web app using React/Vite, optimizing performance to handle real-time deadline visualization.
ro: Am dezvoltat o aplicație web de numărătoare inversă rapidă și minimalistă, folosind React/Vite, optimizând performanța pentru a gestiona vizualizarea în timp real a termenelor limită.

source: Skills
ro: Competențe

source: Awards and Certifications
ro: Premii și certificări

source: Winner of <em>"Realiști fără egal"</em>, edition XI, Informatics discipline
ro: Câștigător al <em>„Realiști fără egal”</em>, ediția a XI-a, disciplina Informatică

source: Participant of <em>"Inovative Evaluation Methods"</em>, University of Bucharest
ro: Participant la <em>„Metode inovative de evaluare”</em>, Universitatea din București

source: European Computer Driving Licence (ECDL)
ro: Certificat European de Operare a Computerului (ECDL)

source: Cambridge B1 Certificate
ro: Certificat Cambridge B1

source: Languages
ro: Limbi

source: Romanian:
ro: Română:

source: English:
ro: Engleză:

source: French:
ro: Franceză:

source: Let's get in touch!
ro: Hai să luăm legătura!

source: First Name
ro: Prenume

source: e.g., John
ro: ex.: Ion

source: This field shoud not be empty.
ro: Acest câmp nu trebuie să fie gol.

source: Last Name
ro: Nume

source: e.g., Doe
ro: ex.: Popescu

source: e.g., john.doe@example.com
ro: ex.: ion.popescu@example.com

source: Please enter a valid email address.
ro: Te rog introdu o adresă de email validă.

source: Company (optional)
ro: Companie (opțional)

source: e.g., YourCompany Inc.
ro: ex.: CompaniaTa SRL

source: No error.
ro: Nicio eroare.

source: Message
ro: Mesaj

source: Write your message here...
ro: Scrie mesajul tău aici...

source: We'll send you a quick confirmation email so you know it went through.
ro: Îți vom trimite rapid un email de confirmare ca să știi că mesajul a fost trimis.

source: Check your spam folder if you don't see it.
ro: Verifică folderul Spam dacă nu îl vezi.

source: Send
ro: Trimite

source: Sent
ro: Trimis

source: Failed
ro: Eșuat
